export const FACULTY_OPTIONS = [
  {
    name: "인문융합공공인재학부",
    majors: [
      "문예창작미디어콘텐츠홍보전공",
      "영미언어문화전공",
      "행정학전공",
      "노동복지전공",
    ],
  },
  { name: "법경영학부", majors: ["법학전공", "경영학전공"] },
  {
    name: "웰니스산업융합학부",
    majors: ["의류산업학전공", "복지상담학전공", "식품영양학전공"],
  },
  {
    name: "식물자원조경학부",
    majors: ["식물생명환경전공", "조경학전공"],
  },
  {
    name: "동물생명융합학부",
    majors: ["동물생명과학전공", "동물응용과학전공"],
  },
  {
    name: "생명공학부",
    majors: ["원예생명공학전공", "응용생명공학전공"],
  },
  {
    name: "건설환경공학부",
    majors: ["토목공학전공", "환경공학전공"],
  },
  {
    name: "사회안전시스템공학부",
    majors: ["안전공학전공", "지역자원시스템공학전공"],
  },
  {
    name: "식품생명화학공학부",
    majors: ["식품생명공학전공", "화학공학전공"],
  },
  {
    name: "컴퓨터응용수학부",
    majors: [
      "소프트웨어&서비스컴퓨팅전공",
      "소프트웨어융합전공",
      "정보보안전공",
      "응용수학전공",
    ],
  },
  {
    name: "ICT로봇기계공학부",
    majors: ["ICT로봇공학전공", "기계공학전공"],
  },
  {
    name: "전자전기공학부",
    majors: ["전자공학전공", "전기공학전공"],
  },
  {
    name: "건축융합학부",
    majors: ["건축학전공(5년제)", "건축공학전공"],
  },
  {
    name: "디자인예술스포츠학부",
    majors: [
      "스포츠과학전공",
      "시각미디어디자인전공",
      "제품공간디자인전공",
      "실용음악전공",
      "귀금속보석공예전공",
    ],
  },
  {
    name: "복지융합학부",
    majors: [
      "사회복지학전공",
      "한국수어교육전공",
      "유아특수보육학전공",
      "의료재활공학전공",
    ],
  },
  {
    name: "사회통합학부",
    majors: ["공공행정전공", "상담심리교육전공", "특수체육학전공"],
  },
  { name: "AI반도체융합학부", majors: ["AI반도체융합전공"] },
  { name: "HK자율전공학부", majors: [] },
  {
    name: "글로벌창의인재학부",
    majors: [
      "글로벌스포츠매니지먼트전공",
      "글로벌경영전공",
      "글로벌인공지능IT전공",
      "식물스마트팜전공",
      "식물생의학전공",
      "바이오에너지전공",
      "아시아문화경영전공",
      "Bio-Mobility전공",
      "English Language, Literature and Language Technology전공",
    ],
  },
  {
    name: "미래융합학부",
    majors: [
      "노동복지전공",
      "행정관리전공",
      "레저스포츠매니지먼트전공",
      "융합레포츠전공",
    ],
  },
  {
    name: "AI융합학부",
    majors: [
      "AI스마트팜융합전공(융합전공)",
      "스마트헬스케어전공(융합전공)",
      "AI빅데이터융합전공(융합전공)",
      "공공헬스케어IT융합전공(융합전공)",
      "반도체융합전공(융합전공)",
      "스마트애그리푸드시스템전공(융합전공)",
      "탄소중립바이오시스템융합전공(융합전공)",
    ],
  },
];
